export function GameOver(props) {
    const handleRestart = function () {
        if (props.onRestart) {
            props.onRestart()
        }
    }

    return (
        <div>
            <p>У твоего слоника заболел живот и вместо того чтобы играть со своими друзьями он пошел к врачу.
                В следующий раз корми слона правильной пищей, чтобы слоник был здоров</p>

            <button onClick={handleRestart}>Но не расстраивайся. Давай сыграем еще раз</button>

            <div style={{ fontSize: "200px" }}>😭</div>
        </div>
    );
}